content/topics/doughnut_economics.md
+++
title = "Doughnut Economics"
author = ["Dorneanu"]
draft = false
+++

by Kate Raworth


## Overview {#overview}

Doughnut Economics (Kate Raworth, 2017) redefines the goal of economics: instead of maximising GDP growth, the aim is to meet the needs of all people within the means of the living planet. The metaphor of a doughnut captures this:

-   **Inner ring (social foundation)**: a set of minimum social standards — food, water, health, education, income, political voice — below which no one should fall
-   **Outer ring (ecological ceiling)**: the [Planetary boundaries]({{< relref "planetary_boundaries.md" >}}) beyond which human pressure destabilises Earth systems
-   **The doughnut itself (safe and just space)**: the region between the two rings where humanity can thrive

The framework is a visual synthesis of two bodies of work: the UN Sustainable Development Goals (social floor) and Rockström's planetary boundaries (ecological ceiling). The doughnut has been adopted as a planning framework by the City of Amsterdam, and influenced the [Wellbeing economy]({{< relref "wellbeing_economy.md" >}}) movement.


## Connection to Earth for All {#connection-to-earth-for-all}

"Earth for All" (Club of Rome, 2022) can be read as a quantitative, policy-operational version of doughnut economics: the [Giant Leaps]({{< relref "giant_leaps.md" >}}) are five policy packages specifically designed to lift humanity above the social floor while staying below the ecological ceiling. The [Earth4All model]({{< relref "earth4all_model.md" >}}) provides the system-dynamics modelling that doughnut economics lacks — quantifying which interventions are necessary and in what order.


## Resources {#resources}

-   2026-06-05 ◦ [Earth for All — Dixson-Declève et al. (Club of Rome, 2022)](https://www.goodreads.com/book/show/60321399-earth-for-all) — positions Giant Leaps as the operational counterpart to doughnut economics; doughnut's social foundation and ecological ceiling both appear in Earth4All's model architecture
